'''
Представьте, что вы готовите ужин и уверены, что все ингредиенты есть. 
Но вдруг обнаруживаете, что нет помидора! Вместо того чтобы бросить готовку, 
вы используете специи или что-то другое. В программировании try-except 
работает так же, чтобы "спасать" программу, если что-то пошло не так.

# Примеры:

1. Если мы читаем файл, но он случайно удален, try-except "поймает" ошибку 
и выведет сообщение, вместо того чтобы программа "упала".

2. Вы ждёте курьера, но он задерживается (ошибка). try-except позволит 
сообщить об этом и продолжить, не останавливая всю "доставку".

try-except — это как запасной план для неожиданных ситуаций в программе.
'''
